//
// efi_lib.h: EFI related helper definitions and functions, outside of the scope and definitions 
//   in the UEFI specification or efi.h header.
//
#pragma once

#include <stdint.h>
#include <stdarg.h>
#include <stdbool.h>

#include "efi.h"

#define PAGE_SIZE 4096  // 4KiB

// ELF Header - x86_64
typedef struct {
    struct {
        UINT8  ei_mag0;
        UINT8  ei_mag1;
        UINT8  ei_mag2;
        UINT8  ei_mag3;
        UINT8  ei_class;
        UINT8  ei_data;
        UINT8  ei_version;
        UINT8  ei_osabi;
        UINT8  ei_abiversion;
        UINT8  ei_pad[7];
    } e_ident;

    UINT16 e_type;
    UINT16 e_machine;
    UINT32 e_version;
    UINT64 e_entry;
    UINT64 e_phoff;
    UINT64 e_shoff;
    UINT32 e_flags;
    UINT16 e_ehsize;
    UINT16 e_phentsize;
    UINT16 e_phnum;
    UINT16 e_shentsize;
    UINT16 e_shnum;
    UINT16 e_shstrndx;
} __attribute__ ((packed)) ELF_Header_64;

// ELF Program Header - x86_64
typedef struct {
    UINT32 p_type;
    UINT32 p_flags;
    UINT64 p_offset;
    UINT64 p_vaddr;
    UINT64 p_paddr;
    UINT64 p_filesz;
    UINT64 p_memsz;
    UINT64 p_align;
} __attribute__ ((packed)) ELF_Program_Header_64;

// Elf Header e_type values
typedef enum {
    ET_EXEC = 0x2,
    ET_DYN  = 0x3,
} ELF_EHEADER_TYPE;

// Elf Program header p_type values
typedef enum {
    PT_NULL = 0x0,
    PT_LOAD = 0x1,  // Loadable
} ELF_PHEADER_TYPE;

// PE Structs/types
// PE32+ COFF File Header
typedef struct {
    UINT16 Machine;             // 0x8664 = x86_64
    UINT16 NumberOfSections;    // # of sections to load for program
    UINT32 TimeDateStamp;
    UINT32 PointerToSymbolTable;
    UINT32 NumberOfSymbols;
    UINT16 SizeOfOptionalHeader;
    UINT16 Characteristics;
} __attribute__ ((packed)) PE_Coff_File_Header_64;

// COFF File Header Characteristics
typedef enum {
    IMAGE_FILE_EXECUTABLE_IMAGE = 0x0002,
} PE_COFF_CHARACTERISTICS;

// PE32+ Optional Header
typedef struct {
    UINT16 Magic;                       // 0x10B = PE32, 0x20B = PE32+
    UINT8  MajorLinkerVersion;
    UINT8  MinorLinkerVersion;
    UINT32 SizeOfCode;
    UINT32 SizeOfInitializedData;
    UINT32 SizeOfUninitializedData;
    UINT32 AddressOfEntryPoint;         // Entry Point address (RVA from image base in memory)
    UINT32 BaseOfCode;
    UINT64 ImageBase;
    UINT32 SectionAlignment;
    UINT32 FileAlignment;
    UINT16 MajorOperatingSystemVersion;
    UINT16 MinorOperatingSystemVersion;
    UINT16 MajorImageVersion;
    UINT16 MinorImageVersion;
    UINT16 MajorSubsystemVersion;
    UINT16 MinorSubsystemVersion;
    UINT32 Win32VersionValue;
    UINT32 SizeOfImage;                 // Size in bytes of entire file (image) incl. headers
    UINT32 SizeOfHeaders;
    UINT32 CheckSum;
    UINT16 Subsystem;
    UINT16 DllCharacteristics;
    UINT64 SizeOfStackReserve;
    UINT64 SizeOfStackCommit;
    UINT64 SizeOfHeapReserve;
    UINT64 SizeOfHeapCommit;
    UINT32 LoaderFlags;
    UINT32 NumberOfRvaAndSizes;
} __attribute__ ((packed)) PE_Optional_Header_64;

// Optional Header DllCharacteristics
typedef enum {
    IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE = 0x0040, // PIE executable
} PE_OPTIONAL_HEADER_DLLCHARACTERISTICS;

// PE32+ Section Headers - Immediately following the Optional Header
typedef struct {
    UINT64 Name;                                // 8 byte, null padded UTF-8 string
    UINT32 VirtualSize;                         // Size in memory; If >SizeOfRawData, the difference is 0-padded
    UINT32 VirtualAddress;                      // RVA from image base in memory
    UINT32 SizeOfRawData;                       // Size of actual data (similar to ELF FileSize)
    UINT32 PointerToRawData;                    // Address of actual data
    UINT32 PointerToRelocations;
    UINT32 PointerToLinenumbers;
    UINT16 NumberOfRelocations;
    UINT16 NumberOfLinenumbers;
    UINT32 Characteristics;
}__attribute__ ((packed)) PE_Section_Header_64;

// Timer event context is the text mode screen bounds
typedef struct {
    UINT32 rows; 
    UINT32 cols;
} Timer_Context;

// Memory map and associated meta data
typedef struct {
    UINTN                 size;
    EFI_MEMORY_DESCRIPTOR *map;
    UINTN                 key;
    UINTN                 desc_size;
    UINT32                desc_version;
} Memory_Map_Info;

// Bitmapped font info (assuming monospaced)
typedef struct {
    char     *name;             // Font name
    uint32_t width;             // Glyph width in pixels
    uint32_t height;            // Glyph height in pixels
    uint32_t num_glyphs;        // Number of glyphs in array/font
    uint8_t  *glyphs;           // Glyph data/array
    bool     left_col_first;    // Are bits for glyphs stored in memory left->right 
                                //   e.g. PSF font, or right->left e.g. terminus?
} Bitmap_Font;

// Example Kernel Parameters
typedef struct {
    Memory_Map_Info                   mmap; 
    EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE gop_mode;
    EFI_RUNTIME_SERVICES              *RuntimeServices;
    UINTN                             NumberOfTableEntries;
    EFI_CONFIGURATION_TABLE           *ConfigurationTable;
    UINTN                             num_fonts;
    Bitmap_Font                       *fonts;
} Kernel_Parms;

// Kernel entry point typedef
typedef void EFIAPI (*Entry_Point)(Kernel_Parms *);

// EFI Configuration Table GUIDs and string names
typedef struct {
    EFI_GUID guid;
    char16_t *string;
} Efi_Guid_With_String;

Efi_Guid_With_String config_table_guids_and_strings[] = {
    {EFI_ACPI_TABLE_GUID,   u"EFI_ACPI_TABLE_GUID"},
    {ACPI_TABLE_GUID,       u"ACPI_TABLE_GUID"},
    {SAL_SYSTEM_TABLE_GUID, u"SAL_SYSTEM_TABLE_GUID"},
    {SMBIOS_TABLE_GUID,     u"SMBIOS_TABLE_GUID"},
    {SMBIOS3_TABLE_GUID,    u"SMBIOS3_TABLE_GUID"},
    {MPS_TABLE_GUID,        u"MPS_TABLE_GUID"},
};

// General ACPI table header
//   taken from ACPI Spec 6.4 section 21.2.1
typedef struct {
    char   signature[4];
    UINT32 length;
    UINT8  revision;
    UINT8  checksum;
    char   OEMID[6];
    char   OEM_table_id[8];
    UINT32 OEM_revision;
    char   creator_id[4];
    UINT32 creator_revision;
} ACPI_TABLE_HEADER;

// KEY:
// GDT = Global Descriptor Table
// LDT = Local Descriptor Table
// TSS = Task State Segment

// Use this for GDTR with assembly "LGDT" instruction
typedef struct {
    UINT16 limit;
    UINT64 base; 
} __attribute__((packed)) Descriptor_Register;

// Descriptor e.g. an array of these is used for the GDT/LDT
typedef struct {
    union {
        UINT64 value;
        struct {
            UINT64 limit_15_0:  16;
            UINT64 base_15_0:   16;
            UINT64 base_23_16:  8;
            UINT64 type:        4;
            UINT64 s:           1;  // System descriptor (0), Code/Data segment (1)
            UINT64 dpl:         2;  // Descriptor Privelege Level
            UINT64 p:           1;  // Present flag
            UINT64 limit_19_16: 4;
            UINT64 avl:         1;  // Available for use
            UINT64 l:           1;  // 64 bit (Long mode) code segment
            UINT64 d_b:         1;  // Default op size/stack pointer size/upper bound flag
            UINT64 g:           1;  // Granularity; 1 byte (0), 4KiB (1)
            UINT64 base_31_24:  8;
        };
    };
} X86_64_Descriptor;

// TSS/LDT descriptor - 64 bit
typedef struct {
    X86_64_Descriptor descriptor;
    UINT32 base_63_32;
    UINT32 zero;
} TSS_LDT_Descriptor;

// TSS structure - TSS descriptor points to this structure in the GDT
typedef struct {
    UINT32 reserved_1;
    UINT32 RSP0_lower;
    UINT32 RSP0_upper;
    UINT32 RSP1_lower;
    UINT32 RSP1_upper;
    UINT32 RSP2_lower;
    UINT32 RSP2_upper;
    UINT32 reserved_2;
    UINT32 reserved_3;
    UINT32 IST1_lower;
    UINT32 IST1_upper;
    UINT32 IST2_lower;
    UINT32 IST2_upper;
    UINT32 IST3_lower;
    UINT32 IST3_upper;
    UINT32 IST4_lower;
    UINT32 IST4_upper;
    UINT32 IST5_lower;
    UINT32 IST5_upper;
    UINT32 IST6_lower;
    UINT32 IST6_upper;
    UINT32 IST7_lower;
    UINT32 IST7_upper;
    UINT32 reserved_4;
    UINT32 reserved_5;
    UINT16 reserved_6;
    UINT16 io_map_base;
} TSS;

// Example GDT
typedef struct {
    X86_64_Descriptor  null;                // Offset 0x00
    X86_64_Descriptor  kernel_code_64;      // Offset 0x08
    X86_64_Descriptor  kernel_data_64;      // Offset 0x10
    X86_64_Descriptor  user_code_64;        // Offset 0x18
    X86_64_Descriptor  user_data_64;        // Offset 0x20
    X86_64_Descriptor  kernel_code_32;      // Offset 0x28
    X86_64_Descriptor  kernel_data_32;      // Offset 0x30
    X86_64_Descriptor  user_code_32;        // Offset 0x38
    X86_64_Descriptor  user_data_32;        // Offset 0x40
    TSS_LDT_Descriptor tss;                 // Offset 0x48
} GDT;

// PSF Font types
// Adapted from https://wiki.osdev.org/PC_Screen_Font
#define PSF2_FONT_MAGIC 0x864ab572
typedef struct {
    uint32_t magic;             // Magic bytes to identify PSF file (PSF2_FONT_MAGIC)
    uint32_t version;           // Zero 
    uint32_t headersize;        // Offset of bitmaps in file, 32 
    uint32_t flags;             // 0 if no unicode table
    uint32_t num_glyphs;        // Number of glyphs 
    uint32_t bytes_per_glyph;   // Size of each glyph 
    uint32_t height;            // Height in pixels 
    uint32_t width;             // Width in pixels 
} PSF2_Header;

// -----------------
// Global variables
// -----------------
EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL *cout = NULL;   // Console output
EFI_SIMPLE_TEXT_INPUT_PROTOCOL  *cin  = NULL;   // Console input
EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL *cerr = NULL;   // Console output - stderr

